Сборка начата в 18:35...
1>------ Сборка начата: проект: Lab1, Конфигурация: Debug Any CPU ------
1>Анализаторы пропускаются для ускорения сборки. Для запуска анализаторов можно выполнить команды "Собрать" или "Пересобрать".
1>C:\Users\naste\Source\Repos\BIVT_2024_Lab_1\Lab1\Program.cs(452,13,452,17): warning CS0219: Переменной "days" присвоено значение, но оно ни разу не использовано.
1>C:\Users\naste\Source\Repos\BIVT_2024_Lab_1\Lab1\Program.cs(472,13,472,17): warning CS0219: Переменной "days" присвоено значение, но оно ни разу не использовано.
1>C:\Users\naste\Source\Repos\BIVT_2024_Lab_1\Lab1\Program.cs(497,13,497,17): warning CS0219: Переменной "days" присвоено значение, но оно ни разу не использовано.
1>Lab1 -> C:\Users\naste\Source\Repos\BIVT_2024_Lab_1\Lab1\bin\Debug\net8.0\Lab1.dll
1>Сборка проекта "Lab1.csproj" завершена.
2>------ Сборка начата: проект: Lab1Tests, Конфигурация: Debug Any CPU ------
========== Сборка: успешно выполнено — 2 , со сбоем — 0, в актуальном состоянии — 0, пропущено — 0 ==========
========== Сборка завершено в 18:35 и заняло 01,070 с ==========
Ускоренные проекты 1 Visual Studio, копирование файлов 3. См. https://aka.ms/vs-build-acceleration.
