Сборка начата в 23:48...
1>------ Сборка начата: проект: Lab1, Конфигурация: Debug Any CPU ------
1>Анализаторы пропускаются для ускорения сборки. Для запуска анализаторов можно выполнить команды "Собрать" или "Пересобрать".
1>C:\Users\naste\Source\Repos\BIVT_2024_Lab_1\Lab1\Program.cs(447,13,447,17): warning CS0219: Переменной "days" присвоено значение, но оно ни разу не использовано.
1>C:\Users\naste\Source\Repos\BIVT_2024_Lab_1\Lab1\Program.cs(467,13,467,17): warning CS0219: Переменной "days" присвоено значение, но оно ни разу не использовано.
1>C:\Users\naste\Source\Repos\BIVT_2024_Lab_1\Lab1\Program.cs(492,13,492,17): warning CS0219: Переменной "days" присвоено значение, но оно ни разу не использовано.
1>Lab1 -> C:\Users\naste\Source\Repos\BIVT_2024_Lab_1\Lab1\bin\Debug\net8.0\Lab1.dll
1>Сборка проекта "Lab1.csproj" завершена.
========== Сборка: успешно выполнено — 1 , со сбоем — 0, в актуальном состоянии — 1, пропущено — 0 ==========
========== Сборка завершено в 23:48 и заняло 00,796 с ==========
Ускоренные проекты 1 Visual Studio, копирование файлов 3. См. https://aka.ms/vs-build-acceleration.
